from py.base_char import *
import py.lite


class skill0(被动技能):
    名称 = '长枪精通'
    所在等级 = 15
    等级上限 = 30
    基础等级 = 20

    def 加成倍率(self, 武器类型):
        if self.等级 == 0:
            return 1.0
        elif self.等级 <= 20:
            return round(1 + 0.01 * self.等级, 5)
        else:
            return round(0.8 + 0.02 * self.等级, 5)

    def 物理攻击力倍率(self, 武器类型):
        return self.加成倍率(武器类型)


class skill1(主动技能):
    名称 = '双重刺击'
    所在等级 = 20
    等级上限 = 60
    基础等级 = 43
    基础 = 3694.57142857143
    成长 = 417.428571428571
    CD = 6.4
    TP成长 = 0.1
    TP上限 = 5


class skill2(主动技能):
    名称 = '行云：风'
    所在等级 = 15
    等级上限 = 60
    基础等级 = 46
    基础 = 2094.93333333333
    成长 = 236.066666666667
    CD = 4.6
    TP成长 = 0.1
    TP上限 = 5


class skill3(主动技能):
    名称 = '行云：疾'
    所在等级 = 20
    等级上限 = 60
    基础等级 = 43
    基础 = 2634.38095238095
    成长 = 297.619047619048
    CD = 5.5
    TP成长 = 0.1
    TP上限 = 5


class skill4(主动技能):
    名称 = '行云：落'
    所在等级 = 25
    等级上限 = 60
    基础等级 = 41
    基础 = 3784.675
    成长 = 427.325
    CD = 7.3
    TP成长 = 0.1
    TP上限 = 5


class skill5(被动技能):
    名称 = '行云：沐'
    所在等级 = 25
    等级上限 = 20
    基础等级 = 10

    def 加成倍率(self, 武器类型):
        if self.等级 == 0:
            return 1.0
        elif self.等级 <= 10:
            return round(1.05 + 0.01 * self.等级, 5)
        else:
            return round(0.95 + 0.02 * self.等级, 5)


class skill6(主动技能):
    名称 = '旋风枪'
    所在等级 = 25
    等级上限 = 60
    基础等级 = 41
    基础 = 4467.65
    成长 = 504.35
    CD = 8.2
    TP成长 = 0.1
    TP上限 = 5


class skill7(主动技能):
    名称 = '无畏波动枪'
    所在等级 = 30
    等级上限 = 60
    基础等级 = 38
    基础 = 5259.13513513513
    成长 = 593.864864864865
    CD = 8.2
    TP成长 = 0.1
    TP上限 = 5


class skill8(主动技能):
    名称 = '升龙破空枪'
    所在等级 = 35
    等级上限 = 60
    基础等级 = 36
    基础 = 8384.54285714286
    成长 = 1091.45714285714
    CD = 20 * 1.05 * 0.87
    TP成长 = 0.1
    TP上限 = 5
    是否有护石 = 1
    护石选项 = ['魔界', '圣痕']

    def 装备护石(self, x):
        if x == 0:
            self.倍率 *= 1.10
            self.CD *= 0.88
        if x == 1:
            self.倍率 *= 1.19
            self.CD *= 0.88


class skill9(主动技能):
    名称 = '狂龙怒啸'
    所在等级 = 40
    等级上限 = 60
    基础等级 = 33
    基础 = 8556.5625
    成长 = 968.4375
    CD = 18.3
    TP成长 = 0.1
    TP上限 = 5
    是否有护石 = 1
    护石选项 = ['魔界', '圣痕']

    def 装备护石(self, x):
        if x == 0:
            self.倍率 *= 1.1
            self.CD *= 0.76
        if x == 1:
            self.倍率 *= 1.188
            self.CD *= 0.76


class skill10(主动技能):
    名称 = '夺命雷霆枪'
    所在等级 = 45
    等级上限 = 60
    基础等级 = 31
    基础 = 21869.8666666667
    成长 = 2472.13333333333
    CD = 42.9
    TP成长 = 0.1
    TP上限 = 5
    是否有护石 = 1
    护石选项 = ['魔界', '圣痕']

    def 装备护石(self, x):
        if x == 0:
            self.倍率 *= 1.24767
        if x == 1:
            self.倍率 *= 1.3276


class skill11(被动技能):
    名称 = '行云：启'
    所在等级 = 48
    等级上限 = 40
    基础等级 = 20

    def 加成倍率(self, 武器类型):
        if self.等级 == 0:
            return 1.0
        else:
            return round(1.06 + 0.015 * self.等级, 5)


class skill12(主动技能):
    名称 = '流云幻灭'
    所在等级 = 50
    等级上限 = 40
    基础等级 = 12
    基础 = 43306.1
    成长 = 13091
    CD = 152.3


class skill13(主动技能):
    名称 = '风火燎原'
    所在等级 = 60
    等级上限 = 40
    基础等级 = 23
    基础 = 21959.0909090909
    成长 = 2480.90909090909
    CD = 29.2
    TP成长 = 0.1
    TP上限 = 5
    是否有护石 = 1
    护石选项 = ['魔界', '圣痕']

    def 装备护石(self, x):
        if x == 0:
            self.倍率 *= 1.275
        if x == 1:
            self.倍率 *= 1.365


class skill14(主动技能):
    名称 = '三一斩月'
    所在等级 = 70
    等级上限 = 40
    基础等级 = 18
    基础 = 28510.88235
    成长 = 3220.117647
    CD = 47.5
    TP成长 = 0.1
    TP上限 = 5
    是否有护石 = 1
    护石选项 = ['魔界', '圣痕']

    def 装备护石(self, x):
        if x == 0:
            self.倍率 *= 1.23
        if x == 1:
            self.倍率 *= 1.31


class skill15(主动技能):
    名称 = '无双突刺'
    所在等级 = 75
    等级上限 = 40
    基础等级 = 16
    基础 = 46982.8
    成长 = 5305.2
    CD = 30.1
    是否有护石 = 1
    护石选项 = ['圣痕']

    def 装备护石(self, x):
        if x == 0:
            self.倍率 *= 1.27049


class skill16(被动技能):
    名称 = '行云：冥'
    所在等级 = 75
    等级上限 = 40
    基础等级 = 11

    def 加成倍率(self, 武器类型):
        if self.等级 == 0:
            return 1.0
        else:
            return round(1.16 + 0.02 * self.等级, 5)


class skill17(主动技能):
    名称 = '流光无影闪'
    所在等级 = 80
    等级上限 = 40
    基础等级 = 13
    基础 = 52609.8333333333
    成长 = 5940.16666666667
    CD = 40.2
    是否有护石 = 1
    护石选项 = ['圣痕']

    def 装备护石(self, x):
        if x == 0:
            self.倍率 *= 1.368


class skill18(主动技能):
    名称 = '极影无形杀'
    所在等级 = 85
    等级上限 = 40
    基础等级 = 5
    基础 = 107737
    成长 = 32553
    CD = 189


class skill19(被动技能):
    名称 = '卓越之力'
    所在等级 = 95
    等级上限 = 40
    基础等级 = 4

    def 加成倍率(self, 武器类型):
        if self.等级 == 0:
            return 1.0
        else:
            return round(1.18 + 0.02 * self.等级, 5)


class skill20(被动技能):
    名称 = '超卓之心'
    所在等级 = 95
    等级上限 = 11
    基础等级 = 1

    def 加成倍率(self, 武器类型):
        if self.等级 == 0:
            return 1.0
        else:
            return round(1.045 + 0.005 * self.等级, 5)


class skill21(被动技能):
    名称 = '觉醒之抉择'
    所在等级 = 100
    等级上限 = 40
    基础等级 = 2
    关联技能 = ['无']

    def 加成倍率(self, 武器类型):
        if self.等级 == 0:
            return 1.0
        else:
            return round(1.10 + 0.05 * self.等级, 5)


skill_list = []
i = 0
while i >= 0:
    try:
        exec('skill_list.append(skill' + str(i) + '())')
        i += 1
    except:
        i = -1

skill_sn = dict()
for i in range(len(skill_list)):
    skill_sn[skill_list[i].名称] = i

skill_sn_awaking1 = 0
skill_sn_awaking2 = 0
skill_sn_awaking3 = 0
for i in skill_list:
    if i.所在等级 == 50:
        skill_sn_awaking1 = skill_sn[i.名称]
    if i.所在等级 == 85:
        skill_sn_awaking2 = skill_sn[i.名称]
    if i.所在等级 == 100:
        skill_sn_awaking3 = skill_sn[i.名称]

圣武枪魂护石选项 = ['无']
for i in skill_list:
    if i.是否有伤害 == 1 and i.是否有护石 == 1:
        圣武枪魂护石选项.append(i.名称)

圣武枪魂符文选项 = ['无']
for i in skill_list:
    if i.所在等级 >= 20 and i.所在等级 <= 80 and i.所在等级 != 50 and i.是否有伤害 == 1:
        圣武枪魂符文选项.append(i.名称)


class character(py.lite.char_base):
    def 角色賦予(self):
        self.attr["实际名称"] = '圣武枪魂'
        self.attr["角色"] = '魔枪士'
        self.attr["职业"] = '决战者'

        self.attr["武器选项"] = ['长枪']

        self.attr["类型"] = '物理百分比'
        self.attr["防具类型"] = '轻甲'
        self.attr["防具精通属性"] = ['力量']

        self.attr["主BUFF"] = 2.0

    def 角色数据输入(self):
        self.attr["技能SP等级"] = [20, 43, 46, 43, 41, 10, 41, 38, 36, 33, 31, 20, 12, 23, 18, 16, 11, 13, 5, 4, 1, 2]
        self.attr["技能TP等级"] = [0, 0, 5, 5, 5, 0, 0, 0, 5, 0, 5, 0, 0, 5, 5, 0, 0, 0, 0, 0, 0, 0]
        self.attr["技能释放次数"] = ['', '0', '4', '4', '3', '', '3', '2', '2', '0', '1', '', '1', '1', '1', '1', '', '1', '1', '', '', '']
        self.attr["技能宠物次数"] = [0, 0, 1, 1, 1, 0, 1, 1, 0, 0, 1, 0, 1, 1, 1, 1, 0, 1, 1, 0, 0, 0]

        self.attr["装备栏"] = ['撒旦：沸腾之怒', '贝利亚尔：毁灭之种', '亚蒙：谎言之力', '亚巴顿：绝望地狱', '巴尔：堕落之魂', '白象之庇护', '四叶草之初心', '红兔之祝福', '军神的古怪耳环', '军神的遗书', '军神的庇护宝石', '幻影狂欢长枪']
        self.attr["套装栏"] = ['噩梦：地狱之路[2]', '噩梦：地狱之路[3]', '噩梦：地狱之路[5]', '幸运三角[2]', '幸运三角[3]', '军神的隐秘遗产[2]', '军神的隐秘遗产[3]']
        self.attr["武器类型"] = "长枪"

        self.attr["强化等级"] = [10, 10, 10, 10, 10, 10, 10, 10, 12, 10, 10, 12]
        self.attr["是否增幅"] = [1, 1, 1, 1, 1, 1, 1, 1, 0, 1, 1, 0]
        self.attr["武器锻造等级"] = 8

        self.attr["左槽白金技能"] = "长枪精通"
        self.attr["右槽白金技能"] = "长枪精通"
        self.attr["时装上衣技能"] = "行云：沐"

        self.attr["三觉技能选择"] = "二觉序号"

    def 三觉技能选择(self):
        for i, 技能 in enumerate(self.attr["技能栏"]):
            if 技能.名称 == "觉醒之抉择":
                技能.关联技能 = [self.attr["技能栏"][self.attr[self.attr["三觉技能选择"]]].名称]

    def 被动倍率计算(self):
        super().被动倍率计算()
        技能栏 = self.attr["技能栏"]
        武器类型 = self.attr["武器类型"]

        x = 技能栏[11].加成倍率(武器类型)
        技能栏[2].被动倍率 *= (0.025 + x) / x
        技能栏[3].被动倍率 *= (0.020 + x) / x
        技能栏[4].被动倍率 *= (0.015 + x) / x

        y = 技能栏[16].加成倍率(武器类型)
        for i in [1, 2, 3, 4]:
            技能栏[i].被动倍率 *= (0.01 + y) / y
