from math import *
from py.base_char import *
import py.lite


# 武器巨剑
class 大地女神主动技能(主动技能):
    def 等效CD(self, 武器类型):
        if 武器类型 == '巨剑':
            return round(self.CD / self.恢复 * 1, 1)


# 骑士信念
class skill0(被动技能):
    名称 = '骑士信念'
    所在等级 = 15
    等级上限 = 20
    基础等级 = 10

    def 加成倍率(self, 武器类型):
        if self.等级 == 0:
            return 1.0
        else:
            return round(1.10 + 0.02 * self.等级, 5)

    def 物理攻击力倍率(self, 武器类型):
        if self.等级 == 0:
            return 1.0
        else:
            return round(1.10 + 0.02 * self.等级, 5)


# 一觉被动 由于一觉二觉主动不受剑盾猛攻连锁BUFF加成，所以这里有个额外的加成，这个一绝被动加成吃两次
# 例如：一绝被动=1.42，二觉受到的加成为1.42*1.42
class skill1(被动技能):
    名称 = '自然恩泽'
    所在等级 = 48
    等级上限 = 40
    基础等级 = 20

    def 加成倍率(self, 武器类型):
        if self.等级 == 0:
            return 1.0
        else:
            return round(1.00 + 0.02 * self.等级, 5)


# 二觉被动
class skill2(被动技能):
    名称 = '信仰鼓舞'
    所在等级 = 75
    等级上限 = 40
    基础等级 = 11

    def 加成倍率(self, 武器类型):
        if self.等级 == 0:
            return 1.0
        else:
            return round(1.18 + 0.02 * self.等级, 5)


# 卓越之力
class skill3(被动技能):
    名称 = '卓越之力'
    所在等级 = 95
    等级上限 = 40
    基础等级 = 4

    def 加成倍率(self, 武器类型):
        if self.等级 == 0:
            return 1.0
        else:
            return round(1.18 + 0.02 * self.等级, 5)


# 超卓之心
class skill4(被动技能):
    名称 = '超卓之心'
    所在等级 = 95
    等级上限 = 11
    基础等级 = 1

    def 加成倍率(self, 武器类型):
        if self.等级 == 0:
            return 1.0
        else:
            return round(1.045 + 0.005 * self.等级, 5)


# 觉醒之抉择
class skill5(被动技能):
    名称 = '觉醒之抉择'
    所在等级 = 100
    等级上限 = 40
    基础等级 = 2
    关联技能 = ['无']

    def 加成倍率(self, 武器类型):
        if self.等级 == 0:
            return 1.0
        else:
            return round(1.10 + 0.05 * self.等级, 5)


# 剑盾猛攻 一级默认13%，但测试实际为12.5%，游戏内显示每2级提高1%，但测试伤害实际为每级0.5%
# 剑盾猛攻本身不受剑盾猛攻连锁BUFF加成，一二觉也不受加成，剑盾强袭加成=（剑盾猛攻加成+5%）*连锁层数
class skill6(大地女神主动技能):
    名称 = '剑盾猛攻'
    所在等级 = 30
    等级上限 = 16
    基础等级 = 6
    基础 = 906.4
    成长 = 273.6
    CD = 0.5
    关联技能 = ['所有']

    def 加成倍率(self, 武器类型):
        if self.等级 == 0:
            return 1.0
        else:
            return round(1.72 + 0.03 * self.等级, 5)


# 盾挑    技能太多了，这个就不写上去了，Z，吃基础精通
# class skill7(大地女神主动技能):
#    名称 = '盾挑'
#    所在等级 = 1
#    等级上限 = 20
#    基础等级 = 10
#    基础 = 89
#    成长 = 11
#    CD = 2
#    TP成长 = 0.08
#    TP上限 = 5

# 强踢
class skill7(大地女神主动技能):
    名称 = '强踢'
    所在等级 = 1
    等级上限 = 60
    基础等级 = 50
    基础 = 684.7
    成长 = 77.3
    CD = 5


# 盾击
class skill8(大地女神主动技能):
    名称 = '盾击'
    所在等级 = 5
    等级上限 = 60
    基础等级 = 50
    基础 = 293.9
    成长 = 33.1
    CD = 3


# 致命突刺
class skill9(大地女神主动技能):
    名称 = '致命突刺'
    所在等级 = 10
    等级上限 = 60
    基础等级 = 48
    基础 = 163.1
    成长 = 22.9
    CD = 3


# 愤怒冲撞
class skill10(大地女神主动技能):
    名称 = '愤怒冲撞'
    所在等级 = 15
    等级上限 = 60
    基础等级 = 46
    基础 = 1895.9
    成长 = 214.1
    CD = 9


# 破武之轮
class skill11(大地女神主动技能):
    名称 = '破武之轮'
    所在等级 = 15
    等级上限 = 60
    基础等级 = 46
    基础 = 1071.6
    成长 = 160.4
    CD = 6


# 守护神鹿
class skill12(大地女神主动技能):
    名称 = '守护神鹿'
    所在等级 = 20
    等级上限 = 60
    基础等级 = 43
    基础 = 1466.4
    成长 = 165.6
    CD = 6


# 审判之盾
class skill13(大地女神主动技能):
    名称 = '审判之盾'
    所在等级 = 20
    等级上限 = 60
    基础等级 = 43
    基础 = 1910
    成长 = 216
    CD = 7


# 破甲冲击
class skill14(大地女神主动技能):
    名称 = '破甲冲击'
    所在等级 = 25
    等级上限 = 60
    基础等级 = 41
    基础 = 1621.8
    成长 = 183.2
    CD = 7
    TP成长 = 0.10
    TP上限 = 5


# 精灵之跃 蓄力提高15%伤害，默认一瞬间释放也提高3%，冲击波不受加成，一级刮痧技能就不写那么多了
class skill15(大地女神主动技能):
    名称 = '精灵之跃'
    所在等级 = 30
    等级上限 = 60
    基础等级 = 38
    基础 = 2675.8
    成长 = 302.2
    CD = 7.5
    TP成长 = 0.10
    TP上限 = 5


# 神木刺击
class skill16(大地女神主动技能):
    名称 = '神木刺击'
    所在等级 = 30
    等级上限 = 60
    基础等级 = 38
    基础 = 2420.6
    成长 = 273.4
    CD = 10
    TP成长 = 0.10
    TP上限 = 5


# 铁壁推进 持盾推进8秒，18hit，但一般学1级用来刮痧，这里就做1hit使用
class skill17(大地女神主动技能):
    名称 = '铁壁推进'
    所在等级 = 35
    等级上限 = 60
    基础等级 = 36
    基础 = 367.4
    成长 = 41.6
    CD = 20
    TP成长 = 0.10
    TP上限 = 5


# 自然束缚
class skill18(大地女神主动技能):
    名称 = '自然束缚'
    所在等级 = 35
    等级上限 = 60
    基础等级 = 36
    基础 = 4000.3
    成长 = 451.7
    CD = 15
    TP成长 = 0.10
    TP上限 = 5
    是否有护石 = 1


# 一刀两断
class skill19(大地女神主动技能):
    名称 = '一刀两断'
    所在等级 = 35
    等级上限 = 60
    基础等级 = 36
    基础 = 3502.4
    成长 = 395.6
    CD = 15
    TP成长 = 0.10
    TP上限 = 5
    是否有护石 = 1

    护石选项 = ['魔界', '圣痕']

    def 装备护石(self, x):
        if x == 0:
            self.倍率 *= 1.2653516366
        elif x == 1:
            self.倍率 *= 1.3467485255


# 飓风旋枪 刺击2HIT，旋风10hit
class skill20(大地女神主动技能):
    名称 = '飓风旋枪'
    所在等级 = 40
    等级上限 = 60
    基础等级 = 33
    基础 = 7114.3
    成长 = 803.7
    CD = 25
    演出时间 = 2
    TP成长 = 0.10
    TP上限 = 5
    是否有护石 = 1

    护石选项 = ['魔界', '圣痕']

    def 装备护石(self, x):
        if x == 0:
            self.倍率 *= 1.1714
            self.CD *= 0.90
        elif x == 1:
            self.倍率 *= 1.258886811
            self.CD *= 0.90


# 天陨断空斩
class skill21(大地女神主动技能):
    名称 = '天陨断空斩'
    所在等级 = 45
    等级上限 = 60
    基础等级 = 31
    基础 = 10129.2
    成长 = 1143.8
    CD = 45
    TP成长 = 0.10
    TP上限 = 5
    是否有护石 = 1

    护石选项 = ['魔界', '圣痕']

    def 装备护石(self, x):
        if x == 0:
            self.倍率 *= 1.2053
        elif x == 1:
            self.倍率 *= 1.2859


# 一觉 1+4+1 hit
class skill22(大地女神主动技能):
    名称 = '天马流星落'
    所在等级 = 50
    等级上限 = 40
    基础等级 = 12
    基础 = 32891.3
    成长 = 9930.6
    CD = 159.5


# 生命审判
class skill23(大地女神主动技能):
    名称 = '生命审判'
    所在等级 = 60
    等级上限 = 40
    基础等级 = 23
    基础 = 9299.1
    成长 = 1049.9
    CD = 30
    TP成长 = 0.10
    TP上限 = 5
    是否有护石 = 1

    护石选项 = ['魔界', '圣痕']

    def 装备护石(self, x):
        if x == 0:
            self.倍率 *= 1.08
        elif x == 1:
            self.倍率 *= 1.08 + 0.09


# 壁垒突袭
class skill24(大地女神主动技能):
    名称 = '壁垒突袭'
    所在等级 = 70
    等级上限 = 40
    基础等级 = 18
    基础 = 16225.2
    成长 = 1831.8
    CD = 50
    TP成长 = 0.10
    TP上限 = 5
    是否有护石 = 1

    护石选项 = ['魔界', '圣痕']

    def 装备护石(self, x):
        if x == 0:
            self.倍率 *= 1.221
        elif x == 1:
            self.倍率 *= 1.3055


# 剑盾强袭
class skill25(大地女神主动技能):
    名称 = '剑盾强袭'
    所在等级 = 75
    等级上限 = 40
    基础等级 = 16
    基础 = 22287.6
    成长 = 2516.4
    CD = 40
    是否有护石 = 1

    护石选项 = ['圣痕']

    def 装备护石(self, x):
        if x == 0:
            self.倍率 *= 1.35


# 自然之怒  1+6+1 hit
class skill26(大地女神主动技能):
    名称 = '自然之怒'
    所在等级 = 80
    等级上限 = 40
    基础等级 = 13
    基础 = 26353
    成长 = 2976
    CD = 45
    是否有护石 = 1

    护石选项 = ['圣痕']

    def 装备护石(self, x):
        if x == 0:
            self.倍率 *= 1.3452212


# 二觉    3+1+5 hit
class skill27(大地女神主动技能):
    名称 = '暮光之灵黄昏独角兽'
    所在等级 = 85
    等级上限 = 40
    基础等级 = 5
    基础 = 76675
    成长 = 23148.2
    CD = 198


skill_list = []
i = 0
while i >= 0:
    try:
        exec('skill_list.append(skill' + str(i) + '())')
        i += 1
    except:
        i = -1

skill_sn = dict()
for i in range(len(skill_list)):
    skill_sn[skill_list[i].名称] = i

skill_sn_awaking1 = 0
skill_sn_awaking2 = 0
skill_sn_awaking3 = 0
for i in skill_list:
    if i.所在等级 == 50:
        skill_sn_awaking1 = skill_sn[i.名称]
    if i.所在等级 == 85:
        skill_sn_awaking2 = skill_sn[i.名称]
    if i.所在等级 == 100:
        skill_sn_awaking3 = skill_sn[i.名称]

大地女神护石选项 = ['无']
for i in skill_list:
    if i.是否有伤害 == 1 and i.是否有护石 == 1:
        大地女神护石选项.append(i.名称)

大地女神符文选项 = ['无']
for i in skill_list:
    if i.所在等级 >= 20 and i.所在等级 <= 80 and i.所在等级 != 50 and i.是否有伤害 == 1:
        大地女神符文选项.append(i.名称)


class character(py.lite.char_base):
    def 角色賦予(self):
        self.attr["实际名称"] = '大地女神'
        self.attr["角色"] = '守护者'
        self.attr["职业"] = '精灵骑士'

        self.attr["武器选项"] = ['巨剑']

        self.attr["类型"] = '物理百分比'
        self.attr["防具类型"] = '板甲'
        self.attr["防具精通属性"] = ['力量']

        self.attr["主BUFF"] = 2.03

    def 角色数据输入(self):
        self.attr["技能SP等级"] = [10, 20, 11, 4, 1, 2, 6, 1, 1, 1, 1, 1, 1, 1, 1, 1, 38, 1, 1, 36, 33, 31, 12, 18, 18, 16, 13, 5]
        self.attr["技能TP等级"] = [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 5, 0, 0, 5, 5, 5, 0, 1, 5, 0, 0, 0]
        self.attr["技能释放次数"] = ['', '', '', '', '', '', '30', '1', '2', '1', '2', '1', '1', '1', '3', '1', '2', '1', '2', '/CD', '/CD', '1', '1', '1', '1', '1', '1', '1']
        self.attr["技能宠物次数"] = [0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1]

        self.attr["装备栏"] = ['撒旦：沸腾之怒', '贝利亚尔：毁灭之种', '亚蒙：谎言之力', '亚巴顿：绝望地狱', '巴尔：堕落之魂', '白象之庇护', '四叶草之初心', '红兔之祝福', '军神的古怪耳环', '军神的遗书', '军神的庇护宝石', '神之意象']
        self.attr["套装栏"] = ['噩梦：地狱之路[2]', '噩梦：地狱之路[3]', '噩梦：地狱之路[5]', '幸运三角[2]', '幸运三角[3]', '军神的隐秘遗产[2]', '军神的隐秘遗产[3]']
        self.attr["武器类型"] = "巨剑"

        self.attr["强化等级"] = [10, 10, 10, 10, 10, 10, 10, 10, 12, 10, 10, 12]
        self.attr["是否增幅"] = [1, 1, 1, 1, 1, 1, 1, 1, 0, 1, 1, 0]
        self.attr["武器锻造等级"] = 8

        self.attr["左槽白金技能"] = "骑士信念"
        self.attr["右槽白金技能"] = "骑士信念"
        self.attr["时装上衣技能"] = "自然恩泽"

        self.attr["三觉技能选择"] = "二觉序号"

    def 三觉技能选择(self):
        for i, 技能 in enumerate(self.attr["技能栏"]):
            if 技能.名称 == "觉醒之抉择":
                技能.关联技能 = [self.attr["技能栏"][self.attr[self.attr["三觉技能选择"]]].名称]
                break

    def 被动倍率计算(self):
        super().被动倍率计算()
        技能栏 = self.attr["技能栏"]
        武器类型 = self.attr["武器类型"]

        技能栏[skill_sn['天马流星落']].被动倍率 /= 技能栏[skill_sn['剑盾猛攻']].加成倍率(武器类型)
        技能栏[skill_sn['暮光之灵黄昏独角兽']].被动倍率 /= 技能栏[skill_sn['剑盾猛攻']].加成倍率(武器类型)
        技能栏[skill_sn['天马流星落']].被动倍率 *= 技能栏[skill_sn['自然恩泽']].加成倍率(武器类型)
        技能栏[skill_sn['暮光之灵黄昏独角兽']].被动倍率 *= 技能栏[skill_sn['自然恩泽']].加成倍率(武器类型)
        技能栏[skill_sn['剑盾强袭']].被动倍率 /= 技能栏[skill_sn['剑盾猛攻']].加成倍率(武器类型)
        技能栏[skill_sn['剑盾强袭']].被动倍率 *= 0.30 + 技能栏[skill_sn['剑盾猛攻']].加成倍率(武器类型)
        技能栏[skill_sn['剑盾猛攻']].被动倍率 /= 技能栏[skill_sn['剑盾猛攻']].加成倍率(武器类型)
