from py.base_char import *
import py.lite


class skill0(主动技能):
    名称 = '直拳冲击'
    所在等级 = 5
    等级上限 = 60
    基础等级 = 50
    基础 = 432.9387 * 1.13
    成长 = 49.0612 * 1.13
    基础2 = 651.4489 * 1.13
    成长2 = 73.5510 * 1.13
    攻击次数2 = 1
    CD = 3.0
    TP成长 = 0.08
    TP上限 = 5


class skill1(被动技能):
    名称 = '意念驱动'
    所在等级 = 15
    等级上限 = 20
    基础等级 = 10
    是否主动 = 1
    冷却关联技能 = ['直拳冲击', '圣拳锤击', '俯冲翔拳', '俯冲直拳', '俯冲腹拳', '瞬拳', '圣拳连击', '神圣反击', '破碎之锤', '漩涡重拳', '刺拳猛击', '神圣组合拳', '极速飓风拳', '破碎之拳', '破坏之拳', '仲裁怒击', '超重拳', '浩势审判']

    def 加成倍率(self, 武器类型):
        if self.等级 == 0:
            return 1.0
        else:
            return round(1.013 + 0.02 * self.等级, 5)

    def CD缩减倍率(self, 武器类型):
        if 武器类型 == '图腾':
            return 0.9
        else:
            return 1.0


class skill2(被动技能):
    名称 = '技巧精通'
    所在等级 = 20
    等级上限 = 20
    基础等级 = 10

    def 加成倍率(self, 武器类型):
        if self.等级 == 0:
            return 1.0
        elif self.等级 <= 10:
            return round(1.00 + 0.01 * self.等级, 5)
        else:
            return round(1.10 + 0.015 * (self.等级 - 10), 5)


class skill3(主动技能):
    名称 = '圣拳锤击'
    所在等级 = 15
    等级上限 = 60
    基础等级 = 43
    基础 = 213.8095 * 1.13
    成长 = 24.1904 * 1.13
    基础2 = 1927.3095 * 1.13
    成长2 = 217.6904 * 1.13
    攻击次数2 = 1
    CD = 5.0
    TP成长 = 0.1
    TP上限 = 5


class skill4(主动技能):
    名称 = '俯冲翔拳'
    所在等级 = 20
    等级上限 = 60
    基础等级 = 46
    基础 = 1501.3778 * 1.1 * 1.169
    成长 = 169.2222 * 1.1 * 1.169
    CD = 3.5
    TP成长 = 0.10
    TP上限 = 5


class skill5(主动技能):
    名称 = '俯冲直拳'
    所在等级 = 20
    等级上限 = 60
    基础等级 = 46
    基础 = 1492.4667 * 1.1 * 1.173
    成长 = 168.5333 * 1.1 * 1.173
    CD = 3.5
    TP成长 = 0.10
    TP上限 = 5


class skill6(主动技能):
    名称 = '俯冲腹拳'
    所在等级 = 20
    等级上限 = 60
    基础等级 = 43
    基础 = 1630.0238 * 1.1 * 1.151
    成长 = 183.9761 * 1.1 * 1.151
    CD = 3.5
    TP成长 = 0.10
    TP上限 = 5


class skill7(主动技能):
    名称 = '瞬拳'
    所在等级 = 25
    等级上限 = 60
    基础等级 = 41
    基础 = 1667.6 * 1.13
    成长 = 188.4 * 1.13
    基础2 = 416.925 * 1.13
    成长2 = 47.075 * 1.13
    攻击次数2 = 1
    CD = 4
    TP成长 = 0.10
    TP上限 = 5


class skill8(主动技能):
    名称 = '圣拳连击'
    所在等级 = 25
    等级上限 = 60
    基础等级 = 41
    基础 = 832.85 * 1.132
    成长 = 94.15 * 1.132
    基础2 = 1018.95 * 1.132
    成长2 = 115.05 * 1.132
    攻击次数2 = 1
    基础3 = 1235.55 * 1.132
    成长3 = 139.45 * 1.132
    攻击次数3 = 1
    CD = 7.0
    TP成长 = 0.10
    TP上限 = 5


class skill9(主动技能):
    名称 = '神圣反击'
    所在等级 = 30
    等级上限 = 11
    基础等级 = 1
    基础 = 0
    成长 = 303
    CD = 6


class skill10(主动技能):
    名称 = '破碎之锤'
    所在等级 = 30
    等级上限 = 60
    基础等级 = 38
    基础 = 2094.4864 * 1.13
    成长 = 236.5135 * 1.13
    基础2 = 1396.3243 * 1.13
    成长2 = 157.6756 * 1.13
    攻击次数2 = 1
    CD = 6.0
    TP成长 = 0.10
    TP上限 = 5


class skill11(主动技能):
    名称 = '漩涡重拳'
    所在等级 = 35
    等级上限 = 60
    基础等级 = 36
    基础 = 3764.2857 * 1.131
    成长 = 425.7142 * 1.131
    基础2 = 5655.5428 * 1.131
    成长2 = 638.4571 * 1.131
    攻击次数2 = 1
    CD = 20
    TP成长 = 0.10
    TP上限 = 5
    是否有护石 = 1
    护石选项 = ['魔界', '圣痕']

    def 装备护石(self, x):
        if x == 0:
            self.基础 *= 1.4
            self.成长 *= 1.4
            self.基础2 *= 1.2
            self.成长2 *= 1.2
        elif x == 1:
            self.基础 *= 1.4
            self.成长 *= 1.4
            self.基础2 *= 1.35
            self.成长2 *= 1.35


class skill12(主动技能):
    名称 = '刺拳猛击'
    所在等级 = 35
    等级上限 = 60
    基础等级 = 36
    基础 = 384.5142 * 1.128
    成长 = 43.48571 * 1.128
    攻击次数 = 10
    基础2 = 1149.1714 * 1.128
    成长2 = 129.8285 * 1.128
    攻击次数2 = 1
    基础3 = 746.6
    成长3 = 84.4
    攻击次数3 = 1
    CD = 10
    TP成长 = 0
    TP上限 = 5


class skill13(主动技能):
    名称 = '神圣组合拳'
    所在等级 = 40
    等级上限 = 60
    基础等级 = 33
    基础 = 2068.5 * 1.13
    成长 = 233.5 * 1.13
    基础2 = 2697.4062 * 1.13
    成长2 = 304.5937 * 1.13
    攻击次数2 = 1
    基础3 = 4226.8125 * 1.13
    成长3 = 477.1874 * 1.13
    攻击次数3 = 1
    CD = 16
    TP成长 = 0.1
    TP上限 = 5
    是否有护石 = 1
    护石选项 = ['魔界', '圣痕']

    def 装备护石(self, x):
        if x == 0:
            self.基础 *= 1.17
            self.成长 *= 1.17
            self.基础2 *= 1.17
            self.成长2 *= 1.17
            self.基础3 *= 1.17
            self.成长3 *= 1.17
        elif x == 1:
            self.基础 *= 1.26
            self.成长 *= 1.26
            self.基础2 *= 1.26
            self.成长2 *= 1.26
            self.基础3 *= 1.26
            self.成长3 *= 1.26


class skill14(主动技能):
    名称 = '极速飓风拳'
    所在等级 = 45
    等级上限 = 60
    基础等级 = 31
    基础 = 1389.1 * 1.13
    成长 = 156.9 * 1.13
    攻击次数 = 10
    基础2 = 5954.6333 * 1.13
    成长2 = 672.3666 * 1.13
    攻击次数2 = 1
    CD = 45
    TP成长 = 0.1
    TP上限 = 5
    是否有护石 = 1
    护石选项 = ['魔界', '圣痕']

    def 装备护石(self, x):
        if x == 0:
            self.基础 *= 0.97
            self.成长 *= 0.97
            self.攻击次数 = 6
            self.攻击次数2 = 0
            self.CD = 15
            self.基础释放次数 = 2
        elif x == 1:
            self.基础 *= 1.04
            self.成长 *= 1.04
            self.攻击次数 = 6
            self.攻击次数2 = 0
            self.CD = 15
            self.基础释放次数 = 2


class skill15(被动技能):
    名称 = '干涸之泉'
    所在等级 = 48
    等级上限 = 40
    基础等级 = 20

    def 加成倍率(self, 武器类型):
        if self.等级 == 0:
            return 1.0
        else:
            return round(1.025 + 0.02 * self.等级, 5)


class skill16(主动技能):
    名称 = '泯灭神击'
    所在等级 = 50
    等级上限 = 40
    基础等级 = 12
    基础 = 40394 * 1.1 * 1.136
    成长 = 12198 * 1.1 * 1.136
    CD = 145.0


class skill17(主动技能):
    名称 = '破碎之拳'
    所在等级 = 60
    等级上限 = 40
    基础等级 = 23
    基础 = 12525.9091 * 1.13
    成长 = 1414.0909 * 1.13
    基础2 = 3131.3636 * 1.13
    成长2 = 353.6363 * 1.13
    攻击次数2 = 1
    基础3 = 5218.6363 * 1.13
    成长3 = 589.3636 * 1.13
    攻击次数3 = 1
    CD = 35.0
    TP成长 = 0.10
    TP上限 = 5
    是否有护石 = 1
    护石选项 = ['魔界', '圣痕']

    def 装备护石(self, x):
        if x == 0:
            self.基础 *= 1.3
            self.成长 *= 1.3
            self.基础3 *= 1.28
            self.基础3 *= 1.28
            self.CD *= 0.88
        elif x == 1:
            self.基础 *= 1.3
            self.成长 *= 1.3
            self.基础3 *= 1.78
            self.基础3 *= 1.78
            self.CD *= 0.88


class skill18(主动技能):
    名称 = '破坏之拳'
    所在等级 = 70
    等级上限 = 40
    基础等级 = 18
    基础 = 25962.4705 * 1.13
    成长 = 2931.5294 * 1.13
    CD = 40.0
    TP成长 = 0.10
    TP上限 = 5
    是否有护石 = 1
    护石选项 = ['魔界', '圣痕']

    def 装备护石(self, x):
        if x == 0:
            self.基础 *= 1.2
            self.成长 *= 1.2
        elif x == 1:
            self.基础 *= 1.28
            self.成长 *= 1.28


class skill19(主动技能):
    名称 = '仲裁怒击'
    所在等级 = 75
    等级上限 = 40
    基础等级 = 16
    基础 = 50485.8 * 1.116
    成长 = 5700.2 * 1.116
    CD = 40.0
    是否有护石 = 1
    护石选项 = ['圣痕']

    def 装备护石(self, x):
        if x == 0:
            self.基础 *= 1.36
            self.成长 *= 1.36


class skill20(被动技能):
    名称 = '正义惩戒'
    所在等级 = 75
    等级上限 = 40
    基础等级 = 11

    def 加成倍率(self, 武器类型):
        if self.等级 == 0:
            return 1.0
        else:
            return round(1.22 + 0.02 * self.等级, 5)


class skill21(主动技能):
    名称 = '超重拳'
    所在等级 = 80
    等级上限 = 40
    基础等级 = 13
    基础 = 56623.16667 * 1.132
    成长 = 6392.83333 * 1.132
    CD = 40.0
    是否有护石 = 1
    护石选项 = ['圣痕']

    def 装备护石(self, x):
        if x == 0:
            self.基础 *= 1.35
            self.成长 *= 1.35


class skill22(主动技能):
    名称 = '制裁：怒火疾风'
    所在等级 = 85
    等级上限 = 40
    基础等级 = 5
    基础 = 100940 * 1.192
    成长 = 30458 * 1.192
    CD = 180.0


class skill23(被动技能):
    名称 = '唯一正义'
    所在等级 = 95
    等级上限 = 40
    基础等级 = 4

    def 加成倍率(self, 武器类型):
        if self.等级 == 0:
            return 1.0
        else:
            return round(1.18 + 0.02 * self.等级, 5)


class skill24(主动技能):
    名称 = '浩势审判'
    所在等级 = 95
    等级上限 = 40
    基础等级 = 6
    基础 = 22712.6 / 1.1
    成长 = 2564.4 / 1.1
    基础2 = 1702.6 / 1.1
    成长2 = 192.4 / 1.1
    攻击次数2 = 20
    基础3 = 56782 / 1.1
    成长3 = 6411 / 1.1
    攻击次数3 = 1
    CD = 60.0


class skill25(主动技能):
    名称 = '正义执行：雷梅迪奥斯圣座'
    所在等级 = 100
    等级上限 = 40
    基础等级 = 2
    基础 = 135155 / 1.1
    成长 = 40802 / 1.1
    基础2 = 202734 / 1.1
    成长2 = 61202 / 1.1
    攻击次数2 = 1
    CD = 290.0

    关联技能 = ['无']

    def 加成倍率(self, 武器类型):
        return 0.0


skill_list = []
i = 0
while i >= 0:
    try:
        exec('skill_list.append(skill' + str(i) + '())')
        i += 1
    except:
        i = -1

skill_sn = dict()
for i in range(len(skill_list)):
    skill_sn[skill_list[i].名称] = i

skill_sn_awaking1 = 0
skill_sn_awaking2 = 0
skill_sn_awaking3 = 0
for i in skill_list:
    if i.所在等级 == 50:
        skill_sn_awaking1 = skill_sn[i.名称]
    if i.所在等级 == 85:
        skill_sn_awaking2 = skill_sn[i.名称]
    if i.所在等级 == 100:
        skill_sn_awaking3 = skill_sn[i.名称]

option_talismans = ['无']
for i in skill_list:
    if i.是否有伤害 == 1 and i.是否有护石 == 1:
        option_talismans.append(i.名称)

option_rune = ['无']
for i in skill_list:
    if 20 <= i.所在等级 <= 80 and i.所在等级 != 50 and i.是否有伤害 == 1:
        option_rune.append(i.名称)


class character(py.lite.CharBase):
    def 角色賦予(self):
        self.attr["实际名称"] = '神启_蓝拳圣使'
        self.attr["角色"] = '圣职者(男)'
        self.attr["职业"] = '蓝拳圣使'

        self.attr["武器选项"] = ['图腾', '战斧', '镰刀', '念珠', '十字架']

        self.attr["类型"] = '物理百分比'
        self.attr["防具类型"] = '轻甲'
        self.attr["防具精通属性"] = ['力量']

        self.attr["主BUFF"] = 1.99

    def 角色数据输入(self):
        self.attr["技能SP等级"] = [50, 10, 10, 43, 46, 46, 43, 41, 41, 1, 38, 36, 36, 33, 31, 20, 12, 23, 18, 16, 11, 13, 5, 4, 6, 2]
        self.attr["技能TP等级"] = [0, 0, 0, 0, 0, 0, 0, 0, 5, 0, 0, 5, 0, 5, 5, 0, 0, 5, 1, 0, 0, 0, 0, 0, 0, 0]
        self.attr["技能释放次数"] = ['0', '', '', '0', '0', '0', '0', '0', '3', '0', '3', '2', '0', '2', '4', '', '1', '1', '1', '1', '', '1', '1', '', '1', '1']
        self.attr["技能宠物次数"] = [0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 1, 0, 0, 1, 0, 0, 1, 0, 1, 1, 0, 1, 1, 0, 1, 1]

        self.attr["装备栏"] = ['撒旦：沸腾之怒', '贝利亚尔：毁灭之种', '亚蒙：谎言之力', '亚巴顿：绝望地狱', '巴尔：堕落之魂', '白象之庇护', '四叶草之初心', '红兔之祝福', '军神的古怪耳环', '军神的遗书', '军神的庇护宝石', '暗战终结者']
        self.attr["套装栏"] = ['噩梦：地狱之路[2]', '噩梦：地狱之路[3]', '噩梦：地狱之路[5]', '幸运三角[2]', '幸运三角[3]', '军神的隐秘遗产[2]', '军神的隐秘遗产[3]']
        self.attr["武器类型"] = "图腾"

        self.attr["强化等级"] = [10, 10, 10, 10, 10, 10, 10, 10, 12, 10, 10, 12]
        self.attr["是否增幅"] = [1, 1, 1, 1, 1, 1, 1, 1, 0, 1, 1, 0]
        self.attr["武器锻造等级"] = 8

        self.attr["左槽白金技能"] = "意念驱动"
        self.attr["右槽白金技能"] = "意念驱动"
        self.attr["时装上衣技能"] = "正义惩戒"

        self.attr["三觉技能选择"] = "二觉序号"

    def 三觉技能选择(self):
        self.attr["技能栏"][self.attr[self.attr["三觉技能选择"]]].被动倍率 = 0

    def 被动倍率计算(self):
        super().被动倍率计算()
        # 神圣反击倍率与腹拳一样，但在修炼场手动开只有80%
        技能栏 = self.attr["技能栏"]
        技能栏[skill_sn['神圣反击']].基础 = ((技能栏[skill_sn['俯冲腹拳']].基础 * 1.1) + (技能栏[skill_sn['俯冲腹拳']].等级 * 技能栏[skill_sn['俯冲腹拳']].成长 * 1.1)
                                    * (1 + 技能栏[skill_sn['俯冲腹拳']].TP等级 * 0.1)) * 0.8

        技能栏[skill_sn['刺拳猛击']].攻击次数 += 技能栏[skill_sn['刺拳猛击']].TP等级 * 1
        技能栏[skill_sn['刺拳猛击']].基础2 *= 1 + 技能栏[skill_sn['刺拳猛击']].TP等级 * 0.1
        技能栏[skill_sn['刺拳猛击']].成长2 *= 1 + 技能栏[skill_sn['刺拳猛击']].TP等级 * 0.1
        技能栏[skill_sn['刺拳猛击']].基础3 *= 1 + 技能栏[skill_sn['刺拳猛击']].TP等级 * 0.1
        技能栏[skill_sn['刺拳猛击']].成长3 *= 1 + 技能栏[skill_sn['刺拳猛击']].TP等级 * 0.1
